<!DOCTYPE html>
<html lang="en">
    <head>
        <meta charset="UTF-8">
        <meta name="viewport" content="width=device-width, initial-scale=1.0">
        <title>PHP random quotes</title>   
        <link rel="stylesheet" href="style.css">    
    </head>
    <body>

    <?php
        $quotes = array(
            "আল্লাহকে ভয় করো, কেননা যে তাকে ভয় করে সে কখনো একাকীত্ব অনুভব করে না।" => "[ - উমার ইবনুল খাত্তাব (রাদিয়াল্লাহু আনহু) ]",
            
            "তাওহীদ হলো সমস্ত দোয়া, সমস্ত কান্নাকাটি, সাহায্য চেয়ে সমস্ত আবেদন, সমস্ত আশা এবং সকল কল্যাণের আগমন ও সকল ক্ষতি নিবারণের জন্য প্রার্থনা অন্য কেউ নয় বরং কেবলই আল্লাহর উদ্দেশ্যে হতে হবে।" => "[ - ইমাম মুহাম্মাদ আলী আশ-শাওকানী (আল দূর আল-নাদিদ) ]",

            "আল্লাহর ভয়ে তুমি যা কিছু ছেড়ে দিবে, আল্লাহ তোমাকে অবশ্যই তার চেয়ে উত্তম কিছু দান করবেন।" => "[ - হযরত মোহাম্মদ (সঃ) ]",
            
            "যে নিজের মর্যাদা বোঝে না, অন্যেও তার মর্যাদা দেয় না।" => "[ - হযরত আলী (রাঃ) ]",
            
            "সব দুঃখের মূল এই দুনিয়ার প্রতি অত্যাধিক আকর্ষণ। " => "[ - হযরত আলী (রাঃ) ]",
            
            "রাসুল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইরশাদ করেন, ঈমানের শাখা রয়েছে ষাটের কিছু বেশি। আর লজ্জা ঈমানের একটি শাখা।" => "[ - আবূ হুরায়রা (রাঃ) ]",
            
            "আপনার দ্বারা নেক কাজ সাধিত হলে আল্লাহ তাআলার প্রশংসা করুন, এবং যখন অসফল হবেন তাঁর কাছে ক্ষমা প্রার্থনা করুন।" => "[ - হযরত আলী (রাঃ) ]",

            "দুনিয়া নিয়ে দুঃশ্চিন্তা করা অন্তর হলো অন্ধকারাচ্ছন্ন, আখিরাত নিয়ে দুঃশ্চিন্তা করা অন্তর হলো আলোকিত।" => "[ - হযরত উসমান (রাঃ) ]",

            "অযাচিত দানই দান। চাহিলে অনেক সময় চক্ষুলজ্জায় লোকে দান করে, কিন্তু তা দান নহে।" => "[ - হযরত আলী (রাঃ) ]",
        );


    $mainQuote = array_rand($quotes);
    $nameWriter = $quotes[$mainQuote];
        echo "<div class='wrapper'>
                <p>\"$mainQuote\"</p>
                <span>$nameWriter</span>
                <a href='?'>Refresh</a>
            </div>";

    ?> 
    </body>
</html>
